In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
"EmpID": [1, 2, 3],
"Name": ["Alice", "Bob", "Charlie"],
"DeptID": [10, 20, 30]
})

In [3]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [6]:
departments = pd.DataFrame({
"DeptID": [10, 20, 40],
"DeptName": ["HR", "Engineering", "Marketing"]
})

In [7]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [11]:
pd.merge(employees, departments, on ="DeptID") #Inner Join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [13]:
pd.merge(employees, departments, on ="DeptID", how = "left") #Left Join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [14]:
pd.merge(employees, departments, on ="DeptID", how = "right") #Right Join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [21]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Age": [20, 30]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "Marks": [50, 60]})

In [22]:
df1

    Name  Age
0  Alice   20
1    Bob   30

In [23]:
df2

      Name  Marks
0  Charlie     50
1    David     60

In [24]:
pd.concat([df1, df2])

      Name   Age  Marks
0    Alice  20.0    NaN
1      Bob  30.0    NaN
0  Charlie   NaN   50.0
1    David   NaN   60.0

In [25]:
pd.concat([df1, df2], axis = 1)

    Name  Age     Name  Marks
0  Alice   20  Charlie     50
1    Bob   30    David     60